בתרגיל זה תשתמשו בנתוני הטיטאניק

In [1]:
import pandas as pd

titanic = pd.read_csv("titanic.csv")

In [2]:
titanic.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

1. חלקו את הטבלה לקבוצות עפ המחלקה

In [3]:
classes = titanic.groupby("Pclass")

2. כמה קבוצות נוצרו?

In [4]:
len(classes)

3

3. מה המחיר הממוצע בכל מחלקה?

In [8]:
classes['Fare'].mean()

Pclass
1    84.154687
2    20.662183
3    13.707707
Name: Fare, dtype: float64

4. כמה שורדים יש בכל מחלקה?

In [15]:
survivers = classes['Survived'].sum()

5. מה אחוז השורדים בכל מחלקה?

6. בעזרת לולאה הדפיסו עבור כל מחלקה מה אחוז השורדים בה בפורמט הבא:  
   Survival rate for class 1 is 62.96%

In [ ]:
for Pclass in range(3):
    print(f"Survival rate for class {Pclass} is {")

7. סיימתם? חזרו על התרגיל והפעם חלקו לקבוצות לפי מגדר